                                         Chapter5 Getting Started with pandas

In [3]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
from pandas import Series, DataFrame

# 5.1 Introduction to pandas Data Strcutures

## Series

In [10]:
obj = pd.Series([1,2,3,4])

In [11]:
obj

0    1
1    2
2    3
3    4
dtype: int64

In [12]:
obj.array

<PandasArray>
[1, 2, 3, 4]
Length: 4, dtype: int64

In [13]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
obj2 = pd.Series([1,2,3,4], index = ["a","b","c","d"])

In [16]:
obj2

a    1
b    2
c    3
d    4
dtype: int64

In [17]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [19]:
obj2["a"]

1

In [20]:
obj2[["b","c"]]

b    2
c    3
dtype: int64

In [21]:
obj2[obj2>0]

a    1
b    2
c    3
d    4
dtype: int64

In [22]:
obj2[obj2>2]

c    3
d    4
dtype: int64

In [23]:
obj*2

0    2
1    4
2    6
3    8
dtype: int64

In [24]:
np.exp(obj2)

a     2.718282
b     7.389056
c    20.085537
d    54.598150
dtype: float64

In [25]:
"a " in obj2

False

In [26]:
"a" in obj2

True

In [28]:
dic = {"a":1, "b":2}

In [29]:
dic

{'a': 1, 'b': 2}

In [31]:
obj3 = pd.Series(dic)

In [32]:
obj3

a    1
b    2
dtype: int64

In [33]:
obj3.to_dict()

{'a': 1, 'b': 2}

In [34]:
indexes = [1,2]

In [35]:
obj3 = pd.Series(obj3, index = indexes)

In [36]:
obj3

1   NaN
2   NaN
dtype: float64

In [37]:
pd.isna(obj3)

1    True
2    True
dtype: bool

In [38]:
pd.notna(obj3)

1    False
2    False
dtype: bool

In [39]:
obj2

a    1
b    2
c    3
d    4
dtype: int64

In [40]:
pbj3

NameError: name 'pbj3' is not defined

In [41]:
obj3

1   NaN
2   NaN
dtype: float64

In [42]:
obj2 + obj3

a   NaN
b   NaN
c   NaN
d   NaN
1   NaN
2   NaN
dtype: float64

In [43]:
obj2 = pd.Series([33,34,35],index = ["a","b","c"])

In [44]:
obj2

a    33
b    34
c    35
dtype: int64

In [45]:
obj2 + obj3

a   NaN
b   NaN
c   NaN
1   NaN
2   NaN
dtype: float64

In [46]:
obj2

a    33
b    34
c    35
dtype: int64

In [47]:
obj2.name= "hello"

In [48]:
obj2

a    33
b    34
c    35
Name: hello, dtype: int64

In [49]:
obj2.index.name = "random"

In [50]:
obj2

random
a    33
b    34
c    35
Name: hello, dtype: int64

## DataFrame

In [55]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [56]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [57]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [58]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [59]:
pd.DataFrame(data,columns=["year","pop","state"])

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [60]:
frame2 = pd.DataFrame(data,columns=["year","pop","state","blank"])

In [61]:
frame2

   year  pop   state blank
0  2000  1.5    Ohio   NaN
1  2001  1.7    Ohio   NaN
2  2002  3.6    Ohio   NaN
3  2001  2.4  Nevada   NaN
4  2002  2.9  Nevada   NaN
5  2003  3.2  Nevada   NaN

In [62]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [63]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [64]:
frame2.loc[1]

year     2001
pop       1.7
state    Ohio
blank     NaN
Name: 1, dtype: object

In [65]:
frame2

   year  pop   state blank
0  2000  1.5    Ohio   NaN
1  2001  1.7    Ohio   NaN
2  2002  3.6    Ohio   NaN
3  2001  2.4  Nevada   NaN
4  2002  2.9  Nevada   NaN
5  2003  3.2  Nevada   NaN

In [66]:
frame2.loc[0]

year     2000
pop       1.5
state    Ohio
blank     NaN
Name: 0, dtype: object

In [67]:
frame2.iloc[0]

year     2000
pop       1.5
state    Ohio
blank     NaN
Name: 0, dtype: object

In [68]:
frame2["debt"] = 15

In [69]:
frame2

   year  pop   state blank  debt
0  2000  1.5    Ohio   NaN    15
1  2001  1.7    Ohio   NaN    15
2  2002  3.6    Ohio   NaN    15
3  2001  2.4  Nevada   NaN    15
4  2002  2.9  Nevada   NaN    15
5  2003  3.2  Nevada   NaN    15

In [71]:
frame2["debt"] = np.arange(6)

In [72]:
frame2

   year  pop   state blank  debt
0  2000  1.5    Ohio   NaN     0
1  2001  1.7    Ohio   NaN     1
2  2002  3.6    Ohio   NaN     2
3  2001  2.4  Nevada   NaN     3
4  2002  2.9  Nevada   NaN     4
5  2003  3.2  Nevada   NaN     5

In [74]:
del frame2["blank"]

In [77]:
frame2

   year  pop   state  debt
0  2000  1.5    Ohio     0
1  2001  1.7    Ohio     1
2  2002  3.6    Ohio     2
3  2001  2.4  Nevada     3
4  2002  2.9  Nevada     4
5  2003  3.2  Nevada     5

In [82]:
populations = {"a": {1:"A"}, "b": {1: "B"}}

In [83]:
populations

{'a': {1: 'A'}, 'b': {1: 'B'}}

In [91]:
frame = pd.DataFrame(populations)

In [92]:
frame

   a  b
1  A  B

In [88]:
frame.T

   1
a  A
b  B

In [94]:
pd.DataFrame(populations,index = [1,2])

     a    b
1    A    B
2  NaN  NaN

In [95]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},"Nevada": {2001: 2.4, 2002: 2.9}}

In [96]:
frame3 = pd.DataFrame(populations)

In [97]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [100]:
frame3["Ohio"][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [101]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [102]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [103]:
frame2

   year  pop   state  debt
0  2000  1.5    Ohio     0
1  2001  1.7    Ohio     1
2  2002  3.6    Ohio     2
3  2001  2.4  Nevada     3
4  2002  2.9  Nevada     4
5  2003  3.2  Nevada     5

In [104]:
frame2.to_numpy()

array([[2000, 1.5, 'Ohio', 0],
       [2001, 1.7, 'Ohio', 1],
       [2002, 3.6, 'Ohio', 2],
       [2001, 2.4, 'Nevada', 3],
       [2002, 2.9, 'Nevada', 4],
       [2003, 3.2, 'Nevada', 5]], dtype=object)

## index object

In [108]:
obj = pd.Series(np.arange(3), index=["a","b","c"])

In [109]:
obj

a    0
b    1
c    2
dtype: int64

In [110]:
index = obj.index

In [111]:
index

Index(['a', 'b', 'c'], dtype='object')

In [112]:
index[2:]

Index(['c'], dtype='object')

In [113]:
labels = pd.Index([1,2,3])

In [114]:
labels

Int64Index([1, 2, 3], dtype='int64')

In [115]:
obj2

random
a    33
b    34
c    35
Name: hello, dtype: int64

In [118]:
obj2 = pd.Series([1,2,3], index = labels)

In [119]:
obj2

1    1
2    2
3    3
dtype: int64

In [124]:
obj2.index is labels

True

In [125]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [126]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object')

In [127]:
2002 in frame3.index

True

In [128]:
labels = pd.Index([1,2,1])

In [129]:
labels

Int64Index([1, 2, 1], dtype='int64')

In [130]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [131]:
obj2 = pd.Series([1,2,3], index = labels)

In [132]:
obj2

1    1
2    2
1    3
dtype: int64

In [133]:
obj2[1]

1    1
1    3
dtype: int64

# 5.2 Essential Functionality

In [151]:
obj = pd.Series([1,2,3,4], index= np.arange(4))

In [152]:
obj

0    1
1    2
2    3
3    4
dtype: int64

## Reindexing

In [172]:
obj = obj.reindex(["a","c","d","b"])

In [149]:
obj

a   NaN
c   NaN
d   NaN
b   NaN
dtype: float64

In [155]:
obj.reindex(np.arange(6),method="ffill")

0    1
1    2
2    3
3    4
4    4
5    4
dtype: int64

In [156]:
frame = pd.DataFrame(np.arange(9).reshape(3,3), index = ["a","b","c"], columns = ["x","y","z"])

In [157]:
frame

   x  y  z
a  0  1  2
b  3  4  5
c  6  7  8

In [160]:
frame2 = frame.reindex(["c","d","a"])

In [161]:
frame2

     x    y    z
c  6.0  7.0  8.0
d  NaN  NaN  NaN
a  0.0  1.0  2.0

In [162]:
frame2 = frame.reindex(columns = ["x","y"])

In [163]:
frame2

   x  y
a  0  1
b  3  4
c  6  7

In [170]:
frame2 = frame.reindex(["x","y","q"], axis = "columns")

In [171]:
frame2

   x  y   q
a  0  1 NaN
b  3  4 NaN
c  6  7 NaN

In [180]:
frame2.loc[["a","b"],["x","y"]]

   x  y
a  0  1
b  3  4

## Dropping Entries from Axis

In [186]:
obj = pd.Series(np.arange(5), index = ["a","b","c","d","e"])

In [187]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [188]:
obj.drop("c")

a    0
b    1
d    3
e    4
dtype: int64

In [189]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [191]:
obj.drop(["d","a"])

b    1
c    2
e    4
dtype: int64

In [192]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [193]:
obj.drop(index="a")

b    1
c    2
d    3
e    4
dtype: int64

In [196]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index = [1,2,3,4], columns = ["a","b","c","d"])

In [197]:
data

    a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [198]:
data.drop(columns="a")

    b   c   d
1   1   2   3
2   5   6   7
3   9  10  11
4  13  14  15

In [199]:
data.drop(index = 1)

    a   b   c   d
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [201]:
data.drop(index = 1, columns = "a")

    b   c   d
2   5   6   7
3   9  10  11
4  13  14  15

In [202]:
data.drop(index = [1,2])

    a   b   c   d
3   8   9  10  11
4  12  13  14  15

## indexing, Selection and Filtering

In [208]:
obj = pd.Series(np.arange(4), index = ["a","b","c","d"])

In [209]:
obj

a    0
b    1
c    2
d    3
dtype: int64

In [210]:
obj["b"]

1

In [211]:
obj["a"]

0

In [212]:
obj[1:]

b    1
c    2
d    3
dtype: int64

In [213]:
obj[1]

1

In [214]:
obj[["a","b"]]

a    0
b    1
dtype: int64

In [216]:
obj[[0,1]]

a    0
b    1
dtype: int64

In [217]:
obj[obj<2]

a    0
b    1
dtype: int64

In [218]:
obj[obj>2]

d    3
dtype: int64

In [220]:
obj.loc[["a","b"]]

a    0
b    1
dtype: int64

In [221]:
obj.iloc[[1,2]]

b    1
c    2
dtype: int64

In [222]:
data

    a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [223]:
data["a"]

1     0
2     4
3     8
4    12
Name: a, dtype: int64

In [224]:
data[["a","b"]]

    a   b
1   0   1
2   4   5
3   8   9
4  12  13

In [226]:
data.loc[[1,2]]

   a  b  c  d
1  0  1  2  3
2  4  5  6  7

In [227]:
data.iloc[[1,2,0]]

   a  b   c   d
2  4  5   6   7
3  8  9  10  11
1  0  1   2   3

In [228]:
data[data["a"]>0]

    a   b   c   d
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [229]:
data

    a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [231]:
data.loc[1,["a","b"]]

a    0
b    1
Name: 1, dtype: int64

In [232]:
data

    a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [235]:
data.loc[1]

a    0
b    1
c    2
d    3
Name: 1, dtype: int64

In [236]:
data.loc[:]

    a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [237]:
data.loc[[1,2]]

   a  b  c  d
1  0  1  2  3
2  4  5  6  7

In [238]:
data.loc[data.c == 2, "c"] = 5

In [239]:
data

    a   b   c   d
1   0   1   5   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [245]:
data.loc[data.c ==5,"d"] = 7

In [246]:
data

    a   b   c   d
1   0   1   5   7
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

## Arithmetic and Data Alighment

In [249]:
s1 = pd.Series([1,2,3,4],index=["a","b","c","d"])

In [250]:
s1

a    1
b    2
c    3
d    4
dtype: int64

In [251]:
s2 = pd.Series([5,6,7,8],index=["a","b","c","d"])

In [252]:
s2

a    5
b    6
c    7
d    8
dtype: int64

In [253]:
s1 + s2

a     6
b     8
c    10
d    12
dtype: int64

In [254]:
data

    a   b   c   d
1   0   1   5   7
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [255]:
data1 = data.copy()

In [256]:
data1

    a   b   c   d
1   0   1   5   7
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [258]:
data1 + data

    a   b   c   d
1   0   2  10  14
2   8  10  12  14
3  16  18  20  22
4  24  26  28  30

In [263]:
data1 = pd.DataFrame(data1, columns=[ "a","b","c","d","e"])

In [264]:
data1

    a   b   c   d   e
1   0   1   5   7 NaN
2   4   5   6   7 NaN
3   8   9  10  11 NaN
4  12  13  14  15 NaN

In [266]:
data1 + data

    a   b   c   d   e
1   0   2  10  14 NaN
2   8  10  12  14 NaN
3  16  18  20  22 NaN
4  24  26  28  30 NaN

In [268]:
data1.add(data1, fill_value=0)

    a   b   c   d   e
1   0   2  10  14 NaN
2   8  10  12  14 NaN
3  16  18  20  22 NaN
4  24  26  28  30 NaN

In [271]:
data

    a   b   c   d
1   0   1   5   7
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [272]:
1/data

          a         b         c         d
1       inf  1.000000  0.200000  0.142857
2  0.250000  0.200000  0.166667  0.142857
3  0.125000  0.111111  0.100000  0.090909
4  0.083333  0.076923  0.071429  0.066667

In [273]:
data.reindex(columns=data1.columns, fill_value=1)

    a   b   c   d  e
1   0   1   5   7  1
2   4   5   6   7  1
3   8   9  10  11  1
4  12  13  14  15  1

In [276]:
frame = pd.DataFrame(np.arange(12).reshape(4,3), index = [1,2,3,4], columns = ["x","y","z"])

In [277]:
frame

   x   y   z
1  0   1   2
2  3   4   5
3  6   7   8
4  9  10  11

In [284]:
Series = frame.iloc[0]

In [285]:
Series

x    0
y    1
z    2
Name: 1, dtype: int64

In [283]:
frame - Series

   x  y  z
1  0  0  0
2  3  3  3
3  6  6  6
4  9  9  9

In [287]:
frame.sub(Series, axis="columns")

   x  y  z
1  0  0  0
2  3  3  3
3  6  6  6
4  9  9  9

In [288]:
Series = frame["x"]

In [289]:
Series

1    0
2    3
3    6
4    9
Name: x, dtype: int64

In [290]:
frame

   x   y   z
1  0   1   2
2  3   4   5
3  6   7   8
4  9  10  11

In [291]:
frame.sub(Series, axis="index")

   x  y  z
1  0  1  2
2  0  1  2
3  0  1  2
4  0  1  2

## Function Application and Mapping

In [294]:
def f(x):
    return x.max() - x.min()

In [296]:
data1

    a   b   c   d   e
1   0   1   5   7 NaN
2   4   5   6   7 NaN
3   8   9  10  11 NaN
4  12  13  14  15 NaN

In [297]:
data

    a   b   c   d
1   0   1   5   7
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [298]:
data.apply(f)

a    12
b    12
c     9
d     8
dtype: int64

In [299]:
data.apply(f,axis="index")

a    12
b    12
c     9
d     8
dtype: int64

In [301]:
data.apply(f,axis="columns")

1    7
2    3
3    3
4    3
dtype: int64

In [303]:
def f(x):
    return pd.Series([x.min(),x.max()],index=["min","max"])

In [304]:
data

    a   b   c   d
1   0   1   5   7
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [305]:
data.apply(f)

      a   b   c   d
min   0   1   5   7
max  12  13  14  15

## Sorting and Ranking

In [310]:
obj = pd.Series(np.arange(4), index=["d","a","c","g"])

In [311]:
obj

d    0
a    1
c    2
g    3
dtype: int64

In [312]:
obj.sort_index()

a    1
c    2
d    0
g    3
dtype: int64

In [313]:
data

    a   b   c   d
1   0   1   5   7
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [315]:
data = data.reindex([2,1,3,4])

In [316]:
data.sort_index()

    a   b   c   d
1   0   1   5   7
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [318]:
data.sort_index(ascending = False)

    a   b   c   d
4  12  13  14  15
3   8   9  10  11
2   4   5   6   7
1   0   1   5   7

In [320]:
obj.sort_values()

d    0
a    1
c    2
g    3
dtype: int64

## Axis Indexes with Duplicate Labels

In [324]:
data

    a   b   c   d
2   4   5   6   7
1   0   1   5   7
3   8   9  10  11
4  12  13  14  15

In [327]:
data.loc[3] = [3,4,5,6]

In [328]:
data

    a   b   c   d
2   4   5   6   7
1   0   1   5   7
3   3   4   5   6
4  12  13  14  15
5   3   4   5   6

In [331]:
data.loc[5]

a    3
b    4
c    5
d    6
Name: 5, dtype: int64

In [333]:
data.iloc[4]

a    3
b    4
c    5
d    6
Name: 5, dtype: int64

In [334]:
data.iloc[4].name

5

    a   b   c   d
2   4   5   6   7
1   0   1   5   7
3   3   4   5   6
4  12  13  14  15
5   3   4   5   6

In [344]:
data = data.reindex([1,2,2,3,4])

In [345]:
data.index.is_unique

False

In [346]:
data

    a   b   c   d
1   0   1   5   7
2   4   5   6   7
2   4   5   6   7
3   3   4   5   6
4  12  13  14  15

# 5.3 Summarizing and Computing Descritive Statistics

In [350]:
df = pd.DataFrame([[1.4, np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]], index = ["a","b","c","d"], columns=["one","two"])

In [351]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [352]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [353]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [354]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [355]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

## Correlation and Covariance

## Unique Values, Value Counts, and Membership

In [361]:
obj = pd.Series(["c","a","d","a"])

In [362]:
obj.unique()

array(['c', 'a', 'd'], dtype=object)

In [364]:
obj.value_counts()

a    2
c    1
d    1
dtype: int64

In [366]:
data = pd.DataFrame({"x":[1,3,4,3,4], "y":[2,3,1,2,3], "z":[1,5,2,4,4]})

In [367]:
data

   x  y  z
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [376]:
data.apply(pd.value_counts).fillna(0)

     x    y    z
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [370]:
data["x"].value_counts()

3    2
4    2
1    1
Name: x, dtype: int64